app/Repositories/AddressRepository.php

    public function getBillingAddressesByUserId($user_id)
    {
        return $this->address::where('user_id', '=',$user_id)->where('is_billing', '=','1')->where('active', '=','1')->get();
---
select * from `addresses` where `user_id` = 1 and `is_billing` = '1' and `active` = '1'

    public function getShippingAddressesByUserId($user_id)
    {
        return $this->address::where('user_id', '=',$user_id)->where('is_shipping', '=','1')->where('active', '=','1')->get();
---
select * from `addresses` where `user_id` = 1 and `is_shipping` = '1' and `active` = '1'

    public function getDefaultBillingAddressByUserId($user_id)
    {
        $user_default_billing_address = null;

        $response =  $this->address::where('user_id', '=',$user_id)->where('is_billing', '=','1')->where('is_default', '=','1')->where('active', '=','1')->get();
---
select * from `addresses` where `user_id` = 1 and `is_billing` = '1' and `is_default` = '1' and `active` = '1'

    public function getDefaultShippingAddressByUserId($user_id)
    {
        $user_default_shipping_address = null;

        $response = $this->address::where('user_id', '=',$user_id)->where('is_shipping', '=','1')->where('is_default', '=','1')->where('active', '=','1')->get();
---
select * from `addresses` where `user_id` = 1 and `is_shipping` = '1' and `is_default` = '1' and `active` = '1'