app/Repositories/CartRepository.php

    public function getCartByUser($user_id)
    {
        return $this->cart::where('user_id', '=',$user_id)->where('validated', '=','0')->where('active', '=','1')->get();
---
select * from `carts` where `user_id` = 1 and `validated` = '0' and `active` = '1'

    public function getCartByUserAndProduct($user_id,$product_id)
    {
        return $this->cart::where('user_id', '=',$user_id)->where('product_id', '=',$product_id)->where('validated', '=','0')->where('active', '=','1')->get();
---
select * from `carts` where `user_id` = 1 and `product_id` = 3 and `validated` = '0' and `active` = '1'

    public function addCart(Array $inputs)
    {
        $cart = new Cart;
        $cart->user_id = Auth::user()->id;
        $cart->product_id = $inputs['product_id'];
        $cart->product_quantity = $inputs['product_quantity'];
        $cart->price = $inputs['product_quantity']* ((double)$inputs['product_price']);
        $cart->created_at = now();
        $cart->updated_at = now();
        $cart->save();
---
insert into `carts` (`user_id`, `product_id`, `product_quantity`, `price`, `created_at`, `updated_at`) values (1, '3', '2', 160, '2020-05-03 17:13:28', '2020-05-03 17:13:28')

    public function setCart(array $inputs)
    {
        // variables
        $user_id = Auth::user()->id;
        $product_id = $inputs['product_id'];
        $product_quantity = (int) $inputs['product_quantity'];
        $product_price = (double)$inputs['product_price'];

        // get cart
        $carts = $this->getCartByUserAndProduct($user_id, $product_id);
        $cart = $carts->first();

        // update cart
        $cart->product_quantity +=  $product_quantity;
        $cart->price =  $cart->product_quantity*$product_price;
        $cart->updated_at = now();
        $cart->save();
---
update `carts` set `product_quantity` = 6, `price` = 480, `updated_at` = '2020-05-03 17:14:36' where `id` = 2

    public function transformCartArticlesIntoCustomCollection(Collection $cart_articles)
    {
        $cart_articles_custom = new Collection();

        if(count($cart_articles)>0)
        {
            $user_id = Auth::user()->id;

            foreach ($cart_articles as $cart_article)
            {
                $product_id = $cart_article->product_id;

                $response = DB::table('carts')
                ->join('users', 'carts.user_id', '=', "users.id")
                ->join('products', 'carts.product_id', '=', "products.id")
                ->select('carts.*', 'users.*', 'products.*', 'carts.id as cart_id', 'carts.price as cart_price')
                ->where('carts.active', '=', '1')
                ->where('carts.user_id', '=', $user_id)
                ->where('carts.product_id', '=', $product_id)
                ->get();
---
select `carts`.*, `users`.*, `products`.*, `carts`.`id` as `cart_id`, `carts`.`price` as `cart_price` from `carts` inner join `users` on `carts`.`user_id` = `users`.`id` inner join `products` on `carts`.`product_id` = `products`.`id` where `carts`.`active` = '1' and `carts`.`user_id` = 1 and `carts`.`product_id` = 2